# TelecomC

int main(void)
{
	int min;

	scanf("%d", &min);

	if  (min<=500)
	{
		printf ("350");
	}
	else 
	{
		printf ("%d", 350+(min - 500)*2);
	}


return 0;
}

Услуги телефонной сети оплачиваются по следующему правилу: за разговоры до 500 минут (включительно) в месяц — 350 руб., а разговоры сверх установленной нормы оплачиваются из расчета 2 руб. за минуту. Написать программу, вычисляющую плату за пользование телефоном для введенного времени разговоров за месяц.

Входные данные:
Одно целое число -- количество минут разговора за прошедший месяц.

Выходные данные: 
Одно целое число -- размер платы в рублях за прошедший месяц.
